; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city)
        (dummy-goal)
        (dummy-fact)
)
(:functions (cost))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc) (dummy-fact)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc) (dummy-fact)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc) (dummy-fact)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc) (dummy-fact)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from) (dummy-fact)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to) (dummy-fact)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))

(:action pref-op0
  :precondition (and (dummy-fact))
  :effect (and (not (dummy-fact)) (dummy-goal)))

(:action pref-op1
:precondition (and (dummy-fact)
(airplane a0) 
(airplane a1) 
(airport l00) 
(airport l10) 
(at a0 l10)
(at a1 l10)
(at p0 l11)
(at p1 l10)
(at t0 l00)
(at t1 l11)
(city c0) 
(city c1) 
(in-city l00 c0) 
(in-city l01 c0) 
(in-city l10 c1) 
(in-city l11 c1) 
(location l00) 
(location l01) 
(location l10) 
(location l11) 
(obj p0) 
(obj p1) 
(truck t0) 
(truck t1) 
)
:effect (and (not (dummy-fact)) (dummy-goal) (increase (cost) 100)))

(:action pref-op2
:precondition (and (dummy-fact)
(airplane a0) 
(airplane a1) 
(airport l00) 
(airport l10) 
(at a0 l10)
(at a1 l10)
(at p0 l11)
(at p1 l11)
(at t0 l00)
(at t1 l11)
(city c0) 
(city c1) 
(in-city l00 c0) 
(in-city l01 c0) 
(in-city l10 c1) 
(in-city l11 c1) 
(location l00) 
(location l01) 
(location l10) 
(location l11) 
(obj p0) 
(obj p1) 
(truck t0) 
(truck t1) 
)
:effect (and (not (dummy-fact)) (dummy-goal) (increase (cost) 100)))

)

; problem
(define (problem logistics-c3-s2-p5-a2)
(:domain logistics-strips)
(:objects a0 a1  - object
          c0 c1 c2  - object
          t0 t1 t2  - object
          l00 l01 l10 l11 l20 l21  - object
          p0 p1 p2 p3 p4  - object
)
(:init (dummy-fact)
(airplane a0) 
(airplane a1) 
(airport l00) 
(airport l10) 
(airport l20) 
(at a0 l00)
(at a1 l10)
(at p1 l01)
(at p3 l00)
(at p4 l01)
(at t0 l01)
(at t1 l11)
(at t2 l21)
(city c0) 
(city c1) 
(city c2) 
(in p0 t1)
(in p2 t1)
(in-city l00 c0) 
(in-city l01 c0) 
(in-city l10 c1) 
(in-city l11 c1) 
(in-city l20 c2) 
(in-city l21 c2) 
(location l00) 
(location l01) 
(location l10) 
(location l11) 
(location l20) 
(location l21) 
(obj p0) 
(obj p1) 
(obj p2) 
(obj p3) 
(obj p4) 
(truck t0) 
(truck t1) 
(truck t2) 
)
(:goal (and
(dummy-fact)
(at p4 l00)
))

)

; plan
1. (fly-airplane a0 l00 l10)
   deleted: (at a0 l00)
   added: (at a0 l10)
   goals met: 1 of 2
2. (fly-airplane a1 l10 l00)
   deleted: (at a1 l10)
   added: (at a1 l00)
   goals met: 1 of 2
3. (load-truck p1 t0 l01)
   deleted: (at p1 l01)
   added: (in p1 t0)
   goals met: 1 of 2
4. (load-truck p4 t0 l01)
   deleted: (at p4 l01)
   added: (in p4 t0)
   goals met: 1 of 2
5. (fly-airplane a0 l10 l20)
   deleted: (at a0 l10)
   added: (at a0 l20)
   goals met: 1 of 2
6. (fly-airplane a1 l00 l20)
   deleted: (at a1 l00)
   added: (at a1 l20)
   goals met: 1 of 2
7. (drive-truck t0 l01 l00 c0)
   deleted: (at t0 l01)
   added: (at t0 l00)
   goals met: 1 of 2
8. (fly-airplane a0 l20 l00)
   deleted: (at a0 l20)
   added: (at a0 l00)
   goals met: 1 of 2
9. (fly-airplane a1 l20 l00)
   deleted: (at a1 l20)
   added: (at a1 l00)
   goals met: 1 of 2
10. (unload-truck p4 t0 l00)
   deleted: (in p4 t0)
   added: (at p4 l00)
   goals met: 2 of 2
